---
kind: property
id: P:Autodesk.Revit.DB.Structure.AnalyticalOpening.PanelId
source: html/fef766b5-06f7-fc88-2fe6-695b94f63887.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalOpening.PanelId Property

ElementId of the AnalyticalPanel parent.

## Syntax (C#)
```csharp
public ElementId PanelId { get; }
```